{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 256], "input_length": 256, "output_dim": 64, "name": "embedding_1", "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "mask_zero": false, "trainable": true, "embeddings_regularizer": null, "input_dim": 70, "embeddings_constraint": null, "dtype": "int32"}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 128, "name": "conv1d_1", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [7], "padding": "valid", "kernel_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 128, "name": "conv1d_2", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [7], "padding": "valid", "kernel_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 64, "name": "conv1d_3", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3], "padding": "valid", "kernel_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 64, "name": "conv1d_4", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3], "padding": "valid", "kernel_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}}, {"class_name": "MaxPooling1D", "config": {"strides": [3], "padding": "valid", "trainable": true, "name": "max_pooling1d_1", "pool_size": [3]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 64, "name": "conv1d_5", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3], "padding": "valid", "kernel_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}}, {"class_name": "MaxPooling1D", "config": {"strides": [3], "padding": "valid", "trainable": true, "name": "max_pooling1d_2", "pool_size": [3]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 64, "name": "conv1d_6", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3], "padding": "valid", "kernel_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}}, {"class_name": "MaxPooling1D", "config": {"strides": [3], "padding": "valid", "trainable": true, "name": "max_pooling1d_3", "pool_size": [3]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "stateful": false, "activation": "tanh", "use_bias": true, "return_sequences": false, "unit_forget_bias": true, "kernel_regularizer": null, "implementation": 0, "trainable": true, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "recurrent_dropout": 0.0, "name": "lstm_1", "activity_regularizer": null, "bias_constraint": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 128, "dropout": 0.0, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "units": 512, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "units": 512, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "name": "dense_3", "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true, "units": 16, "kernel_constraint": null}}], "backend": "tensorflow", "keras_version": "2.0.4"}