{"keras_version": "2.0.5", "config": {"name": "model_1", "layers": [{"name": "start", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "start", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1535, 256]}}, {"name": "initial_causal_conv", "inbound_nodes": [[["start", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "initial_causal_conv", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear"}}, {"name": "dilate_tanh_d1_s0", "inbound_nodes": [[["initial_causal_conv", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [1], "name": "dilate_tanh_d1_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d1_s0", "inbound_nodes": [[["initial_causal_conv", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [1], "name": "dilate_sigmoid_d1_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_1", "inbound_nodes": [[["dilate_tanh_d1_s0", 0, 0, {}], ["dilate_sigmoid_d1_s0", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true}}, {"name": "conv1d_1", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}], ["initial_causal_conv", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"name": "dilate_tanh_d2_s0", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [2], "name": "dilate_tanh_d2_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d2_s0", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [2], "name": "dilate_sigmoid_d2_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_2", "inbound_nodes": [[["dilate_tanh_d2_s0", 0, 0, {}], ["dilate_sigmoid_d2_s0", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true}}, {"name": "conv1d_2", "inbound_nodes": [[["multiply_2", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_2", "inbound_nodes": [[["conv1d_2", 0, 0, {}], ["add_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"name": "dilate_tanh_d4_s0", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [4], "name": "dilate_tanh_d4_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d4_s0", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [4], "name": "dilate_sigmoid_d4_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_3", "inbound_nodes": [[["dilate_tanh_d4_s0", 0, 0, {}], ["dilate_sigmoid_d4_s0", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_3", "trainable": true}}, {"name": "conv1d_3", "inbound_nodes": [[["multiply_3", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_3", "inbound_nodes": [[["conv1d_3", 0, 0, {}], ["add_2", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"name": "dilate_tanh_d8_s0", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [8], "name": "dilate_tanh_d8_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d8_s0", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [8], "name": "dilate_sigmoid_d8_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_4", "inbound_nodes": [[["dilate_tanh_d8_s0", 0, 0, {}], ["dilate_sigmoid_d8_s0", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true}}, {"name": "conv1d_4", "inbound_nodes": [[["multiply_4", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_4", "inbound_nodes": [[["conv1d_4", 0, 0, {}], ["add_3", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"name": "dilate_tanh_d16_s0", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [16], "name": "dilate_tanh_d16_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d16_s0", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [16], "name": "dilate_sigmoid_d16_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_5", "inbound_nodes": [[["dilate_tanh_d16_s0", 0, 0, {}], ["dilate_sigmoid_d16_s0", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_5", "trainable": true}}, {"name": "conv1d_5", "inbound_nodes": [[["multiply_5", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_5", "inbound_nodes": [[["conv1d_5", 0, 0, {}], ["add_4", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_5", "trainable": true}}, {"name": "dilate_tanh_d32_s0", "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [32], "name": "dilate_tanh_d32_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d32_s0", "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [32], "name": "dilate_sigmoid_d32_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_6", "inbound_nodes": [[["dilate_tanh_d32_s0", 0, 0, {}], ["dilate_sigmoid_d32_s0", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_6", "trainable": true}}, {"name": "conv1d_6", "inbound_nodes": [[["multiply_6", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_6", "inbound_nodes": [[["conv1d_6", 0, 0, {}], ["add_5", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_6", "trainable": true}}, {"name": "dilate_tanh_d64_s0", "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [64], "name": "dilate_tanh_d64_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d64_s0", "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [64], "name": "dilate_sigmoid_d64_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_7", "inbound_nodes": [[["dilate_tanh_d64_s0", 0, 0, {}], ["dilate_sigmoid_d64_s0", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_7", "trainable": true}}, {"name": "conv1d_7", "inbound_nodes": [[["multiply_7", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_7", "inbound_nodes": [[["conv1d_7", 0, 0, {}], ["add_6", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_7", "trainable": true}}, {"name": "dilate_tanh_d128_s0", "inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [128], "name": "dilate_tanh_d128_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d128_s0", "inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [128], "name": "dilate_sigmoid_d128_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_8", "inbound_nodes": [[["dilate_tanh_d128_s0", 0, 0, {}], ["dilate_sigmoid_d128_s0", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_8", "trainable": true}}, {"name": "conv1d_8", "inbound_nodes": [[["multiply_8", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_8", "inbound_nodes": [[["conv1d_8", 0, 0, {}], ["add_7", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_8", "trainable": true}}, {"name": "dilate_tanh_d256_s0", "inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [256], "name": "dilate_tanh_d256_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d256_s0", "inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [256], "name": "dilate_sigmoid_d256_s0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_9", "inbound_nodes": [[["dilate_tanh_d256_s0", 0, 0, {}], ["dilate_sigmoid_d256_s0", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_9", "trainable": true}}, {"name": "conv1d_9", "inbound_nodes": [[["multiply_9", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_9", "inbound_nodes": [[["conv1d_9", 0, 0, {}], ["add_8", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_9", "trainable": true}}, {"name": "dilate_tanh_d1_s1", "inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [1], "name": "dilate_tanh_d1_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d1_s1", "inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [1], "name": "dilate_sigmoid_d1_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_10", "inbound_nodes": [[["dilate_tanh_d1_s1", 0, 0, {}], ["dilate_sigmoid_d1_s1", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_10", "trainable": true}}, {"name": "conv1d_10", "inbound_nodes": [[["multiply_10", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_10", "inbound_nodes": [[["conv1d_10", 0, 0, {}], ["add_9", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_10", "trainable": true}}, {"name": "dilate_tanh_d2_s1", "inbound_nodes": [[["add_10", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [2], "name": "dilate_tanh_d2_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d2_s1", "inbound_nodes": [[["add_10", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [2], "name": "dilate_sigmoid_d2_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_11", "inbound_nodes": [[["dilate_tanh_d2_s1", 0, 0, {}], ["dilate_sigmoid_d2_s1", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_11", "trainable": true}}, {"name": "conv1d_11", "inbound_nodes": [[["multiply_11", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_11", "inbound_nodes": [[["conv1d_11", 0, 0, {}], ["add_10", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_11", "trainable": true}}, {"name": "dilate_tanh_d4_s1", "inbound_nodes": [[["add_11", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [4], "name": "dilate_tanh_d4_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d4_s1", "inbound_nodes": [[["add_11", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [4], "name": "dilate_sigmoid_d4_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_12", "inbound_nodes": [[["dilate_tanh_d4_s1", 0, 0, {}], ["dilate_sigmoid_d4_s1", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_12", "trainable": true}}, {"name": "conv1d_12", "inbound_nodes": [[["multiply_12", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_12", "inbound_nodes": [[["conv1d_12", 0, 0, {}], ["add_11", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_12", "trainable": true}}, {"name": "dilate_tanh_d8_s1", "inbound_nodes": [[["add_12", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [8], "name": "dilate_tanh_d8_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d8_s1", "inbound_nodes": [[["add_12", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [8], "name": "dilate_sigmoid_d8_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_13", "inbound_nodes": [[["dilate_tanh_d8_s1", 0, 0, {}], ["dilate_sigmoid_d8_s1", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_13", "trainable": true}}, {"name": "conv1d_13", "inbound_nodes": [[["multiply_13", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_13", "inbound_nodes": [[["conv1d_13", 0, 0, {}], ["add_12", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_13", "trainable": true}}, {"name": "dilate_tanh_d16_s1", "inbound_nodes": [[["add_13", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [16], "name": "dilate_tanh_d16_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d16_s1", "inbound_nodes": [[["add_13", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [16], "name": "dilate_sigmoid_d16_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_14", "inbound_nodes": [[["dilate_tanh_d16_s1", 0, 0, {}], ["dilate_sigmoid_d16_s1", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_14", "trainable": true}}, {"name": "conv1d_14", "inbound_nodes": [[["multiply_14", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_14", "inbound_nodes": [[["conv1d_14", 0, 0, {}], ["add_13", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_14", "trainable": true}}, {"name": "dilate_tanh_d32_s1", "inbound_nodes": [[["add_14", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [32], "name": "dilate_tanh_d32_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d32_s1", "inbound_nodes": [[["add_14", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [32], "name": "dilate_sigmoid_d32_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_15", "inbound_nodes": [[["dilate_tanh_d32_s1", 0, 0, {}], ["dilate_sigmoid_d32_s1", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_15", "trainable": true}}, {"name": "conv1d_15", "inbound_nodes": [[["multiply_15", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_15", "inbound_nodes": [[["conv1d_15", 0, 0, {}], ["add_14", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_15", "trainable": true}}, {"name": "dilate_tanh_d64_s1", "inbound_nodes": [[["add_15", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [64], "name": "dilate_tanh_d64_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d64_s1", "inbound_nodes": [[["add_15", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [64], "name": "dilate_sigmoid_d64_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_16", "inbound_nodes": [[["dilate_tanh_d64_s1", 0, 0, {}], ["dilate_sigmoid_d64_s1", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_16", "trainable": true}}, {"name": "conv1d_16", "inbound_nodes": [[["multiply_16", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_16", "inbound_nodes": [[["conv1d_16", 0, 0, {}], ["add_15", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_16", "trainable": true}}, {"name": "dilate_tanh_d128_s1", "inbound_nodes": [[["add_16", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [128], "name": "dilate_tanh_d128_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d128_s1", "inbound_nodes": [[["add_16", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [128], "name": "dilate_sigmoid_d128_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_17", "inbound_nodes": [[["dilate_tanh_d128_s1", 0, 0, {}], ["dilate_sigmoid_d128_s1", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_17", "trainable": true}}, {"name": "conv1d_17", "inbound_nodes": [[["multiply_17", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_17", "inbound_nodes": [[["conv1d_17", 0, 0, {}], ["add_16", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_17", "trainable": true}}, {"name": "dilate_tanh_d256_s1", "inbound_nodes": [[["add_17", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [256], "name": "dilate_tanh_d256_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"name": "dilate_sigmoid_d256_s1", "inbound_nodes": [[["add_17", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "causal", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [256], "name": "dilate_sigmoid_d256_s1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 256, "kernel_size": [2], "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid"}}, {"name": "multiply_18", "inbound_nodes": [[["dilate_tanh_d256_s1", 0, 0, {}], ["dilate_sigmoid_d256_s1", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_18", "trainable": true}}, {"name": "conv1d_18", "inbound_nodes": [[["multiply_18", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 1, "kernel_size": [1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "add_19", "inbound_nodes": [[["conv1d_1", 0, 0, {}], ["conv1d_2", 0, 0, {}], ["conv1d_3", 0, 0, {}], ["conv1d_4", 0, 0, {}], ["conv1d_5", 0, 0, {}], ["conv1d_6", 0, 0, {}], ["conv1d_7", 0, 0, {}], ["conv1d_8", 0, 0, {}], ["conv1d_9", 0, 0, {}], ["conv1d_10", 0, 0, {}], ["conv1d_11", 0, 0, {}], ["conv1d_12", 0, 0, {}], ["conv1d_13", 0, 0, {}], ["conv1d_14", 0, 0, {}], ["conv1d_15", 0, 0, {}], ["conv1d_16", 0, 0, {}], ["conv1d_17", 0, 0, {}], ["conv1d_18", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_19", "trainable": true}}, {"name": "activation_1", "inbound_nodes": [[["add_19", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "batch_normalization_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "scale": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv1d_19", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 3, "kernel_size": [3], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"name": "conv1d_20", "inbound_nodes": [[["conv1d_19", 0, 0, {}]]], "class_name": "Conv1D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": null, "dilation_rate": [1], "name": "conv1d_20", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "strides": [1], "use_bias": true, "trainable": true, "filters": 3, "kernel_size": [3], "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear"}}, {"name": "embedding", "inbound_nodes": [[["conv1d_20", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "embedding", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "units": 2048, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear"}}, {"name": "dense_1", "inbound_nodes": [[["embedding", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "units": 256, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax"}}], "output_layers": [["dense_1", 0, 0]], "input_layers": [["start", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}